###############################################################
#  Generated by:      Cadence Innovus 21.15-s110_1
#  OS:                Linux x86_64(Host ID cadence)
#  Generated on:      Wed Jun 24 14:35:48 2026
#  Design:            alu
#  Command:           routeDesign -globalDetail
###############################################################
current_design alu
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 1.000000 -waveform {0.000000 0.500000}
set_clock_transition  -rise -min 0.1 [get_clocks {clk}]
set_clock_transition  -rise -max 0.1 [get_clocks {clk}]
set_clock_transition  -fall -min 0.1 [get_clocks {clk}]
set_clock_transition  -fall -max 0.1 [get_clocks {clk}]
set_wire_load_mode enclosed
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {b[2]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {b[0]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {a[3]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {a[1]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {c[2]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {c[0]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {rst}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {b[3]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {b[1]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {a[2]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {c[3]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {a[0]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {c[1]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {y[6]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {y[4]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {y[2]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {y[0]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {y[7]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {y[5]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {y[3]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {y[1]}]
set_clock_uncertainty  0.01 [get_ports {clk}]
