###############################################################
#  Generated by:      Cadence Innovus 21.15-s110_1
#  OS:                Linux x86_64(Host ID cadence)
#  Generated on:      Tue Jun 23 10:00:08 2026
#  Design:            booth
#  Command:           routeDesign -globalDetail
###############################################################
current_design booth
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 1.000000 -waveform {0.000000 0.500000}
set_clock_transition  -rise -min 0.1 [get_clocks {clk}]
set_clock_transition  -rise -max 0.1 [get_clocks {clk}]
set_clock_transition  -fall -min 0.1 [get_clocks {clk}]
set_clock_transition  -fall -max 0.1 [get_clocks {clk}]
set_wire_load_mode enclosed
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {M[3]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {M[1]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {Q[3]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {Q[1]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {load}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {M[2]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {M[0]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {Q[2]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {Q[0]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {reset}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {P[6]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {P[4]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {P[2]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {P[0]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {P[7]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {P[5]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {P[3]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {P[1]}]
set_clock_uncertainty  0.01 [get_ports {clk}]
