###############################################################
#  Generated by:      Cadence Innovus 21.15-s110_1
#  OS:                Linux x86_64(Host ID cadence)
#  Generated on:      Wed Jun 24 13:39:27 2026
#  Design:            TrafficLight
#  Command:           routeDesign -globalDetail
###############################################################
current_design TrafficLight
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 1.000000 -waveform {0.000000 0.500000}
set_clock_transition  -rise -min 0.1 [get_clocks {clk}]
set_clock_transition  -rise -max 0.1 [get_clocks {clk}]
set_clock_transition  -fall -min 0.1 [get_clocks {clk}]
set_clock_transition  -fall -max 0.1 [get_clocks {clk}]
set_wire_load_mode enclosed
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {rst}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {LED_WE[2]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {LED_WE[0]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {LED_NS[1]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {LED_WE[1]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {LED_NS[2]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {LED_NS[0]}]
set_clock_uncertainty  0.01 [get_ports {clk}]
