###############################################################
#  Generated by:      Cadence Innovus 21.15-s110_1
#  OS:                Linux x86_64(Host ID cadence)
#  Generated on:      Wed Jul  1 14:40:57 2026
#  Design:            async_fifo
#  Command:           routeDesign -globalDetail
###############################################################
current_design async_fifo
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {rclk}]  -name rclk -period 1.000000 -waveform {0.000000 0.500000}
set_clock_transition  -rise -min 0.1 [get_clocks {rclk}]
set_clock_transition  -rise -max 0.1 [get_clocks {rclk}]
set_clock_transition  -fall -min 0.1 [get_clocks {rclk}]
set_clock_transition  -fall -max 0.1 [get_clocks {rclk}]
create_clock [get_ports {wclk}]  -name wclk -period 1.000000 -waveform {0.000000 0.500000}
set_clock_transition  -rise -min 0.1 [get_clocks {wclk}]
set_clock_transition  -rise -max 0.1 [get_clocks {wclk}]
set_clock_transition  -fall -min 0.1 [get_clocks {wclk}]
set_clock_transition  -fall -max 0.1 [get_clocks {wclk}]
set_wire_load_mode enclosed
set_input_delay -add_delay 0.4 -max -clock [get_clocks {wclk}] [get_ports {wrst_n}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {rclk}] [get_ports {rrst_n}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {wclk}] [get_ports {wdata[6]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {rclk}] [get_ports {rreq}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {wclk}] [get_ports {wdata[4]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {wclk}] [get_ports {wdata[2]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {wclk}] [get_ports {wdata[0]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {wclk}] [get_ports {wreq}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {wclk}] [get_ports {wdata[7]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {wclk}] [get_ports {wdata[5]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {wclk}] [get_ports {wdata[3]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {wclk}] [get_ports {wdata[1]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {rclk}] [get_ports {rdata[7]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {rclk}] [get_ports {rdata[5]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {rclk}] [get_ports {rdata[3]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {rclk}] [get_ports {rdata[1]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {rclk}] [get_ports {rempty}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {rclk}] [get_ports {rdata[6]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {rclk}] [get_ports {rdata[4]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {rclk}] [get_ports {rdata[2]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {rclk}] [get_ports {rdata[0]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {wclk}] [get_ports {wfull}]
set_clock_uncertainty  0.01 [get_ports {rclk}]
set_clock_uncertainty  0.01 [get_ports {wclk}]
