###############################################################
#  Generated by:      Cadence Innovus 21.15-s110_1
#  OS:                Linux x86_64(Host ID cadence)
#  Generated on:      Mon Jun 22 11:33:11 2026
#  Design:            mealy
#  Command:           routeDesign -globalDetail
###############################################################
current_design mealy
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 0.500000 -waveform {0.000000 0.250000}
set_clock_transition  -rise -min 0.05 [get_clocks {clk}]
set_clock_transition  -rise -max 0.05 [get_clocks {clk}]
set_clock_transition  -fall -min 0.05 [get_clocks {clk}]
set_clock_transition  -fall -max 0.05 [get_clocks {clk}]
set_wire_load_mode enclosed
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {rst}]
set_input_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {din}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {dout_1001}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {dout_1100}]
set_output_delay -add_delay 0.2 -max -clock [get_clocks {clk}] [get_ports {dout_1101}]
set_clock_uncertainty  0.005 [get_ports {clk}]
