###############################################################
#  Generated by:      Cadence Innovus 21.15-s110_1
#  OS:                Linux x86_64(Host ID cadence)
#  Generated on:      Wed Jun 24 09:18:33 2026
#  Design:            count8
#  Command:           routeDesign -globalDetail
###############################################################
current_design count8
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 1.000000 -waveform {0.000000 0.500000}
set_clock_transition  -rise -min 0.1 [get_clocks {clk}]
set_clock_transition  -rise -max 0.1 [get_clocks {clk}]
set_clock_transition  -fall -min 0.1 [get_clocks {clk}]
set_clock_transition  -fall -max 0.1 [get_clocks {clk}]
set_wire_load_mode enclosed
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {rst}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {u_d}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {counter[7]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {counter[5]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {counter[3]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {counter[1]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {counter[6]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {counter[4]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {counter[2]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {counter[0]}]
set_clock_uncertainty  0.01 [get_ports {clk}]
